
arr = [
        "单据号","本次住院次数","社保经办时间","医疗费总费用","自费费用",
        "本次帐户支付","统筹支出","救助金支付金额","公务员补助支付金额","企业补充支付金额",
        "个人现金支付","乙类自理金额","乙类药品自理","乙类诊疗自理","超限价自付费用",
        "符合基本医疗费用","起付标准自付","进入统筹费用","统筹分段自付","进入救助金费用",
        "救助金自付","转诊先自付","超过救助金封顶线个人自付金额","门诊统筹费用","一次性材料费用",
        "药品费用","诊疗项目费用","服务设施费用","统筹支付第一段","统筹支付第二段",
        "统筹支付第三段","统筹支付第四段","二乙民政补助支出","优抚人员财政基金支付","定点医疗机构支付",
        "特检特治统筹支付","账户余额","截止上次门诊统筹费用累计","第一段个人自付","第二段个人自付",
        "第三段个人自付","第四段个人自付","参加工作日期","自付费用","第一段分段下限",
        "第一段分段上限","第一段分段基金支付比例","第一段分段自付比例","第二段分段下限","第二段分段上限",
        "第二段分段基金支付比例","第二段分段自付比例","第三段分段下限","第三段分段上限","第三段分段基金支付比例",
        "第三段分段自付比例","第四段分段下限","第四段分段上限","第四段分段基金支付比例","第四段分段自付比例",
        "第五段分段下限","第五段分段上限","第五段分段基金支付比例","第五段分段自付比例","截至上次本年符合基本医疗累计",
        "截至上次本年基本医疗统筹累计","单位名称","基残人员标志","截至上次本年住院次数","本年门诊统筹累计(包括本次)",
        "本年符合基本医疗累计(包括本次)","本年基本医疗统筹累计(包括本次)","本年门诊慢性病统筹累计","本年门诊慢性病统筹累计和","医院内部住院号",
        "单位类型","乙类药品自付","乙类诊疗自付","自费药品金额","基本医疗公补比例",
        "大额公补比例","首次参保日期","行政职务","截止上次本年救助金累计","本年救助金累计(包括本次)",
        "截止上次本年公务员补助基金累计","本年公务员补助基金累计(包括本次)","公补第一段支付","公补第二段支付","公补第三段支付",
        "统筹公务员补助金额","大额公务员补助金额","超大额公务员补助金额","乙类费用","乙类统筹支付金额",
        "乙类救助金支付金额","超大额公补可报销费用","超大额公补支付","特检特治费用（巴盟）(特检特治进入统筹分段计算)","特检特治大额支付",
        "截止上次本年医疗费总额累计","本年医疗费总额累计（包括本次）","截止上次本年账户支付累计","本年账户支付累计（包括本次）","截止上次本年进入统筹累计金额",
        "本年进入统筹累计金额(包括本次)","截止上次本年进入大额累计金额","本年进入大额累计金额(包括本次)","截止上次本年超大额封顶累计金额","本年超大额封顶累计金额(包括本次)",
        "床位费统筹支付（乌海）","甲类药品费","乙类药品费(包括乙类自理)","床位费总额","参保主险种",
        "参保经办机构","特检特治总费用(鄂尔多斯)(特检特治不进入统筹分段计算)","特检特治自付费用(鄂尔多斯)","门诊慢性病审批编号","伙食补助应付(乌海)",
        "伙食补助统筹支付(乌海)","伙食补助大额支付(乌海)","因封锁个人自付费用（鄂尔多斯）","医院端统筹支付费用(包头)","中心端统筹支付费用(包头)",
        "医院端救助金支付费用(包头)","中心端救助金支付费用（包头）","二次报销大额支付（锡盟）","大病二次报销金额（乌兰察布,乌海）","蒙中项目符合基本医疗费用",
        "蒙中项目统筹支出费用","蒙中项目统筹自付比例（鄂尔多斯）","蒙中项目统筹支付比例（鄂尔多斯）","蒙中项目诊疗项目自付金额（鄂尔多斯）","居民大病补充医疗统筹支付费用（包头）",
        "个人自付合规费用（包头）","门诊统筹起付线累计金额(包括本次)","门诊统筹截至上次起伏线累计金额(呼市)","可享受的门诊公补金额（只区本级能用）","截止上次本年门诊就医公务员补助基金累计（ 只区本级能用）",
        "本年门诊公务员补助基金累计包括本次（只区本级能用）","截至上次住院类符合基本医疗累计(呼市)","本年超大额公务员补助累计（包括本次）","截至上次门慢起伏标准累计","截至上次门慢基金支付累 计（仅通辽有）",
        "截至上次大病合规费用累计（乌海）","进入大病报销的特殊丙类药品(乌海)","大病第一段支付金额(乌海)","大病第二段支付金额(乌海)","大病第三段支付金额(乌海)",
        "大病第四段支付金额(乌海)","大病第一段自付金额(乌海)","大病第二段自付金额(乌海)","大病第三段自付金额(乌海)","大病第四段自付金额(乌海)",
        "大病第一段支付比例(乌海)","大病第二段支付比例(乌海)","大病第三段支付比例(乌海)","大病第四段支付比例(乌海)","大病起付线累计(乌海)",
        "本次支付起付线(乌海)","跨省其他基金支付金额","累计合理自付金额（兴安盟居民）","截止上次合理自付（兴安盟居民）","扶贫商保基金支出（通辽）",
        "民政商保基金支出（通辽）","民政基金支出（通辽）","政府大病兜底基金支出（通辽）","截止上次民政救助住院类累计（通辽）","截止上次民政救助住院符合基本医疗累计（通辽）",
        "统筹超限额医院承担（乌海）","自付超限额医院承担（乌海）","单病种标识（乌海）","分级诊疗标志（乌海分级诊疗）","医院奖励基本医疗费用（区本级）"
    ]

print(len(arr))
import requests
import json


def get_py(input):
    html = requests.get('http://192.168.1.111:8061/api/services/app/ChsHelper/GetPinYin?inputStr=' + input).text
    res = json.loads(html)
    return  res['result']


def write_file(line):
    with open('file1.txt', "a") as f:
        f.write(line)


for str in arr:
    py = get_py(str)
    write_file("/// <summary>\n")
    write_file("/// " + str + "\n")
    write_file("/// <summary>\n")
    write_file("public string "+ py +" { get; set; }\n")